In [1]:
import pandas as pd

Leetcode595

In [2]:
def big_countries(world: pd.DataFrame) -> pd.DataFrame:
    return world[(world['area'] > 3000000) | (world['population'] >= 25000000)][['name','area','population']]

In [3]:
data = {
    'name': ['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola'],
    'continent': ['Asia', 'Europe', 'Africa', 'Europe', 'Africa'],
    'area': [652230, 28748, 2381741, 468, 1246700],
    'population': [25500100, 2831741, 37100000, 78115, 20609294],
    'gdp': [20343000000, 12960000000, 188681000000, 3712000000, 100990000000]
}

df = pd.DataFrame(data)

df

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [4]:
big_countries(df)

          name     area  population
0  Afghanistan   652230    25500100
2      Algeria  2381741    37100000

Leetcode1757

In [5]:
data = {
    'product_id': [0, 1, 2, 3, 4],
    'low_fats': ['Y', 'Y', 'N', 'Y', 'N'],
    'recyclable': ['N', 'Y', 'Y', 'Y', 'N']
}

df = pd.DataFrame(data)
print(df)

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [6]:
def find_products(products: pd.DataFrame) -> pd.DataFrame:
    df = products[(products['low_fats'] == 'Y') & (products['recyclable'] == 'Y')][['product_id']]
    return df

In [7]:
find_products(df)

   product_id
1           1
3           3

leetcode 183. Customers Who Never Order

In [8]:
# Create Customers and Orders data
customers_data = {'id': [1, 2, 3, 4], 'name': ['Joe', 'Henry', 'Sam', 'Max']}
orders_data = {'id': [1, 2], 'customerId': [3, 1]}

# Create dataframes
customers_df = pd.DataFrame(customers_data)
orders_df = pd.DataFrame(orders_data)

In [9]:
def find_customers(customers: pd.DataFrame, orders: pd.DataFrame) -> pd.DataFrame:
    df = pd.merge(orders, customers, left_on='customerId', right_on='id', how='outer')
    df.rename(columns={'name': 'Customers'}, inplace=True)
    df = df[df['customerId'].isnull()]
    df.drop(columns=['customerId', 'id_x', 'id_y'], inplace=True)
    return df

1148. Article Views I

In [13]:
data = {
    'article_id': [1, 1, 2, 2, 4, 3, 3],
    'author_id': [3, 3, 7, 7, 7, 4, 4],
    'viewer_id': [5, 6, 7, 6, 1, 4, 4],
    'view_date': ['2019-08-01', '2019-08-02', '2019-08-01', '2019-08-02', '2019-07-22', '2019-07-21', '2019-07-21']
}

df = pd.DataFrame(data)
df

   article_id  author_id  viewer_id   view_date
0           1          3          5  2019-08-01
1           1          3          6  2019-08-02
2           2          7          7  2019-08-01
3           2          7          6  2019-08-02
4           4          7          1  2019-07-22
5           3          4          4  2019-07-21
6           3          4          4  2019-07-21

In [25]:
def article_views(views: pd.DataFrame) -> pd.DataFrame:
    df = views['author_id'][views['author_id'] == views['viewer_id']].drop_duplicates().reset_index(drop=True)
    new_data = pd.DataFrame(df, dtype='int64')
    new_data.rename(columns={'author_id' : 'id'}, inplace=True)
    new_data.sort_values(by='id', ascending=True, inplace=True)
    return new_data
article_views(df)

   id
1   4
0   7

1683. Invalid Tweets

In [26]:
data = {
    'tweet_id': [1, 2],
    'content': ['Vote for Biden', 'Let us make America great again!']
}

df = pd.DataFrame(data)

In [27]:
def invalid_tweets(tweets: pd.DataFrame) -> pd.DataFrame:
    df = tweets[tweets['content'].str.len() > 15]
    df = df.drop(columns='content')
    return df

invalid_tweets(df)

   tweet_id
1         2

1873. Calculate Special Bonus

In [28]:

data = {
    'employee_id': [2, 3, 7, 8, 9],
    'name': ['Meir', 'Michael', 'Addilyn', 'Juan', 'Kannon'],
    'salary': [3000, 3800, 7400, 6100, 7700]
}

df = pd.DataFrame(data)

In [38]:
def calculate_bonus(data):
    if (data['employee_id'] % 2 == 1) and (not data['name'].startswith('M')):
        data['bonus'] = data['salary'] * 1;
    else:
        data['bonus'] = data['salary'] * 0;
    return data.drop(['name', 'salary'])

def calculate_special_bonus(employees: pd.DataFrame) -> pd.DataFrame:
    df = employees.apply(calculate_bonus, axis=1)
    return df.sort_values(by=['employee_id'])

calculate_special_bonus(df)

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

1667. Fix Names in a Table

In [42]:
data = {
    'user_id': [1, 2],
    'name': ['aLice', 'bOB']
}

df = pd.DataFrame(data)

In [44]:
def fix_names(users: pd.DataFrame) -> pd.DataFrame:
    users['name'] = users['name'].str.capitalize()
    return users.sort_values('user_id')

fix_names(df)

   user_id   name
0        1  Alice
1        2    Bob

1517. Find Users With Valid E-Mails

In [46]:
data = {
    'user_id': [1, 2, 3, 4, 5, 6, 7],
    'name': ['Winston', 'Jonathan', 'Annabelle', 'Sally', 'Marwan', 'David', 'Shapiro'],
    'mail': ['winston@leetcode.com', 'jonathanisgreat', 'bella-@leetcode.com',
             'sally.come@leetcode.com', 'quarz#2020@leetcode.com',
             'david69@gmail.com', '.shapo@leetcode.com']
}

df = pd.DataFrame(data)

In [50]:
def is_valid_email(email):
    if not isinstance(email, str):
        return False
    
    split_at = email.split('@')

    if(len(split_at) != 2):
        return False
    
    front, back = split_at
    if not front[0].isalpha():
        return False
    
    valid_character = set('abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789-._')
    for char in front:
        if char not in valid_character:
            return False
        
    if back != "leetcode.com":
        return False
    
    return True



def valid_emails(users: pd.DataFrame) -> pd.DataFrame:
    users = users[users['mail'].apply(is_valid_email) == True]
    return users
    

valid_emails(df)

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com

1527. Patients With a Condition

In [56]:
data = {
    'patient_id': [1, 2, 3, 4, 5],
    'patient_name': ['Daniel', 'Alice', 'Bob', 'George', 'Alain'],
    'conditions': ['YFEV COUGH', '', 'DIAB100 MYOP', 'ACNE DIAB100', 'DIAB201']
}


df = pd.DataFrame(data)

In [76]:
def is_patient(data):
    if 'SADIAB1' in data:
        return False
    elif 'DIAB1' in data:
        return True
    else:
        return False

def find_patients(patients: pd.DataFrame) -> pd.DataFrame:
    patients = patients[patients['conditions'].apply(is_patient) == True]
    return patients

find_patients(df)

   patient_id patient_name    conditions
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100

177. Nth Highest Salary

In [ ]:
data = {
    'id': [1, 2, 3],
    'salary': [100, 200, 300]
}

df = pd.DataFrame(data)

In [88]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    employee_salary = employee.sort_values(by='salary', ascending=False).drop_duplicates()

    if N <= len(employee_salary):
        return employee_salary.iloc[N-1]['salary']
    else:
        return None
    
nth_highest_salary(df, 2)

200

176. Second Highest Salary

In [89]:
data = {
    'id': [1, 2, 3],
    'salary': [100, 200, 300]
}

df = pd.DataFrame(data)

In [92]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    employee_sorted = employee.sort_values(by='salary', ascending=False).drop_duplicates(subset='salary')

    if len(employee_sorted) < 2:
        return pd.DataFrame({'SecondHighestSalary': [None]})


    return pd.DataFrame({'SecondHighestSalary': [employee_sorted.iloc[1]['salary']]})
    
second_highest_salary(df)

   SecondHighestSalary
0                  200

184. Department Highest Salary

In [99]:
# Create a DataFrame for the Employee table
employee_data = {
    'id': [1, 2, 3, 4, 5],
    'name': ['Joe', 'Jim', 'Henry', 'Sam', 'Max'],
    'salary': [70000, 90000, 80000, 60000, 90000],
    'departmentId': [1, 1, 2, 2, 1]
}

employee_df = pd.DataFrame(employee_data)

# Create a DataFrame for the Department table
department_data = {
    'id': [1, 2],
    'name': ['IT', 'Sales']
}

department_df = pd.DataFrame(department_data)

In [100]:
def department_highest_salary(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:
    combined_df = employee.merge(department, how='left', left_on='departmentId', right_on='id')
    combined_df = combined_df.rename(columns={'name_y': 'Department', 'name_x': 'Employee', 'salary': 'Salary'})
    combined_df = combined_df[['Department', 'Employee', 'Salary']]
    index = combined_df.groupby('Department')['Salary'].transform(max) == combined_df['Salary']
    return combined_df.loc[index]

department_highest_salary(employee_df, department_df)

  Department Employee  Salary
1         IT      Jim   90000
2      Sales    Henry   80000
4         IT      Max   90000

178. Rank Scores

In [101]:
data = {
    'id': [1, 2, 3, 4, 5, 6],
    'score': [3.50, 3.65, 4.00, 3.85, 4.00, 3.65]
}

scores_df = pd.DataFrame(data)

In [107]:
def order_scores(scores: pd.DataFrame) -> pd.DataFrame:
    scores['rank'] = scores['score'].rank(ascending=False, method='dense').astype(int)
    scores = scores[['score', 'rank']]
    return scores.sort_values(by='score', ascending=False)   

order_scores(scores_df)

   score  rank
2   4.00     1
4   4.00     1
3   3.85     2
1   3.65     3
5   3.65     3
0   3.50     4

196. Delete Duplicate Emails

In [116]:
data = {
    'id': [1, 2, 3],
    'email': ['john@example.com', 'bob@example.com', 'john@example.com']
}

df = pd.DataFrame(data)

In [118]:
def delete_duplicate_emails(person: pd.DataFrame) -> None:
    person.sort_values(by=['id'], inplace=True)
    person.drop_duplicates(subset=['email'], keep='first', inplace=True)


delete_duplicate_emails(df)
print(df)

   id             email
0   1  john@example.com
1   2   bob@example.com

1795. Rearrange Products Table

In [127]:
data = {
    'product_id': [0, 1],
    'store1': [95, 70],
    'store2': [100, None],  # Represent missing value as None
    'store3': [105, 80]
}

products_df = pd.DataFrame(data)

In [130]:
def rearrange_products_table(products: pd.DataFrame) -> pd.DataFrame:
    result = pd.melt(products, id_vars=['product_id'], var_name='store', value_name='price')
    result = result.dropna(subset=['price'])
    return result

print(rearrange_products_table(products_df))

   product_id   store  price
0           0  store1   95.0
1           1  store1   70.0
2           0  store2  100.0
4           0  store3  105.0
5           1  store3   80.0

2082. The Number of Rich Customers

In [133]:
# Create a DataFrame for the Store table
data = {
    'bill_id': [6, 8, 4, 11, 13],
    'customer_id': [1, 1, 2, 3, 3],
    'amount': [549, 834, 394, 657, 257]
}

store_df = pd.DataFrame(data)

In [138]:
def count_rich_customers(store: pd.DataFrame) -> pd.DataFrame:
    customers_with_high_bills = store.groupby('customer_id')['amount'].apply(lambda x: (x > 500).any())
    return pd.DataFrame({'rich_count': [customers_with_high_bills.sum()]})

count_rich_customers(store_df)

   rich_count
0           2

1173. Immediate Food Delivery I

In [139]:
data = {
    'delivery_id': [1, 2, 3, 4, 5, 6],
    'customer_id': [1, 5, 1, 3, 4, 2],
    'order_date': ['2019-08-01', '2019-08-02', '2019-08-11', '2019-08-24', '2019-08-21', '2019-08-11'],
    'customer_pref_delivery_date': ['2019-08-02', '2019-08-02', '2019-08-11', '2019-08-26', '2019-08-22', '2019-08-13']
}

delivery_df = pd.DataFrame(data)

# Convert date columns to datetime objects
delivery_df['order_date'] = pd.to_datetime(delivery_df['order_date'])
delivery_df['customer_pref_delivery_date'] = pd.to_datetime(delivery_df['customer_pref_delivery_date'])

delivery_df

   delivery_id  customer_id order_date customer_pref_delivery_date
0            1            1 2019-08-01                  2019-08-02
1            2            5 2019-08-02                  2019-08-02
2            3            1 2019-08-11                  2019-08-11
3            4            3 2019-08-24                  2019-08-26
4            5            4 2019-08-21                  2019-08-22
5            6            2 2019-08-11                  2019-08-13

In [142]:
def food_delivery(delivery: pd.DataFrame) -> pd.DataFrame:
    immediate = (delivery['order_date'] == delivery['customer_pref_delivery_date'])
    precentage = immediate.sum() / len(delivery)
    return pd.DataFrame({'immediate_percentage': [round(precentage*100, 2)]})

food_delivery(delivery_df)

   immediate_percentage
0                 33.33